# bot token
TOKEN = "5273187306:AAEhE6jKkw9a0Kx-MYXYVXhkTefMkz7HKCI"
# bot connected database
db = "sql.db"

# stiker url
sticer_url1 = 'CAACAgIAAxkBAAEDsXth4y_D-lyD2g2ONubixWaerKccXgAC7wwAAtfG8Up7mTZAqPnSZyME'
longitude = 69.273083
latitude = 41.294876

text1 = {
    'uz_latn': "<code>Botga xush kelibsiz Tilni tanlang!</code>",
    'uz_cyrl': "<code>Ботга хуш келибсиз тилни танланг!</code>",
    'ru': "<code>Добро пожаловать в Bot Выберите язык!</code>",
}

again_start_user_bot = {
    'uz_latn': "<code>Sizni yana  ko'rganimdan xursandman!</code> 😊",
    'uz_cyrl': "<code>Сизни яна корганимдан хурсандман!</code> 😊",
    'ru': "<code>Рад снова вас видеть!</code> 😊",
}

get_phone_number_text = {
    'uz_latn': "<code>Botdan foydalanish uchun iltimos telefon raqamingizni kiriting</code>",
    'uz_cyrl': "<code>Ботдан фойдаланиш учун илтимос телефон рақамингизни киритинг</code",
    'ru': "<code>Для использования бота введите свой номер телефона</code>",
}
sign_up_user_text = {
    'uz_latn': "<code>Ro'yxatdan muvafaqiyatli o'tdingiz endi biz sizga quyidagi xizmatlarni taklif qilishimiz mumkin</code>",
    'uz_cyrl': "<code>Рўйхатдан мувафақиятли ўтдингиз енди биз сизга қуйидаги хизматларни таклиф қилишимиз мумкин</code>",
    'ru': "<code> Вы успешно зарегистрировались, теперь мы можем предложить вам следующие услуги </code>",
}
back_user_text = {
    'uz_latn': "<code>Bosh menyuga qaytdik</code>",
    'uz_cyrl': "<code>Мы вернулись в главное меню</code>",
    'ru': "<code> Бош менюга қайтдик </code>",
}
bag = {
    'uz_latn':"Bu so'rov bo'yicha ma'lumot topilmadi",
    'uz_cyrl':"Бу сўров бўйича маълумот топилмади",
    'ru':"По этому запросу не найдено информации"
}

kontakt = {
    'uz_latn':"📱 Kontakt yuborish 📲",
    'uz_cyrl': "📱 Контакт юбориш 📲",
    'ru': "📱 Отправить контакт 📲",
}

menyu_text = {
    'uz_latn': ["🧾 Ariza qoldirish","🏛 Biz haqimizda","📱 Aloqa vositari","⚙️ Sozlamalar"],
    'uz_cyrl': ["🧾 Ариза колдириш", "🏛 Биз xакимизда", "📱 Алока воситари", "⚙️ Созламалар"],
    'ru': ["🧾 Подать заявку", "🏛 О нас", "📱 Средство связи", "⚙️ Настройки"],
}

admin_menyu_text = {
    'uz_latn': ["🧾 Ariza qoldirish","🏛 Biz haqimizda","📱 Aloqa vositari","⚙️ Sozlamalar","👮‍♂️ Admin Panel 🤚"],
    'uz_cyrl': ["🧾 Ариза колдириш", "🏛 Биз xакимизда", "📱 Алока воситари", "⚙️ Созламалар","👮‍♂️ Админ Панел 🤚"],
    'ru': ["🧾 Подать заявку", "🏛 О нас", "📱 Средство связи", "⚙️ Настройки","👮‍♂️ Панель администратора 🤚"],
}

get_user_full_name_text = {
    'uz_latn':"<b>Ims-familiyangizni to'liq kiriting</b>\n<u>Masalan</u>: <code>Shohabbos Sobirov</code>",
    'uz_cyrl':"<b>Имс-фамилиянгизни тўлик киритинг</b>\n<u>Масалан</u>: <code>Шоҳаббос Собиров</code>",
    'ru':"<b> Введите свое полное имя </b> \n <u> Пример </u>: <code> Шохаббос Собиров </code>"
}
get_user_full_name_bag_text = {
    'uz_latn':"<code>Ims-familiyangizni aniqroq kiritishingizni so'raymiz</code>\n<u>Masalan</u>: <b>Shohabbos Sobirov</b>",
    'uz_cyrl':"<code>Имс-фамилиянгизни аниқроқ киритишингизни сўраймиз</code>\n<u>Масалан</u>: <b>Шоҳаббос Собиров</b>",
    'ru':"<code> Пожалуйста, укажите вашу фамилию точнее </code> \n<u>Например</u>: <b> Шохаббос Собиров </b>"
}
get_user_job_text = {
    'uz_latn':"<b>Kasbingizni kiriting</b>\n<u>Masalan</u>: <code>Dasturchi</code>",
    'uz_cyrl':"<b>Касбингизни киритинг</b>\n<u>Масалан</u>: <code>Дастурчи</code>",
    'ru':"<b> Введите свою профессию </b> \n<u>Пример </u>: <code> Разработчик </code>"
}
back_batton_text = {
    'uz_latn':"⬅️ Orqaga",
    'uz_cyrl': "⬅️ Оркага",
    'ru': "⬅️ Назад",
}

get_user_service_text = {
    'uz_latn':"<b>Qaysi xizmat turidan foydalanmoqchisiz tanlang</b>",
    'uz_cyrl':"<b>Выберите, какой тип услуги вы хотите использовать</b>",
    'ru':"<b>Кайси хизмат туридан фойдаланмокчисиз танланг</b>"
}
get_addres_text = {
    'uz_latn':"<b>Obyekt manzilini kiriting (Shayhontohur tumani,Gulobod 90-uy, 9-xonadon)</b>",
    'uz_cyrl':"<b>Объект манзилини киритинг (Шайхонтохур тумани, Гулобод 90-уй, 9-хонадон)</b>",
    'ru':"<b>Введите адрес объекта (Шайхонтохурский район, Гулобод 90, кв.9)</b>"
}

get_user_addres_bag_text = {
    'uz_latn':"<code>Obyekt manzilini aniqroq kiriting (Shayhontohur tumani,Gulobod 90-uy, 9-xonadon)</code>",
    'uz_cyrl':"<code>Введите точный адрес объекта (Шайхантахурский район, Гулобод 90, кв.9) </code>",
    'ru':"<code>Объект манзилини аникрок киритинг (Шайхонтохур тумани, Гулобод 90-уй, 9-хонадон)</code>"
}

get_object_situation_text = {
    'uz_latn':"<b>Obyekt ta'mir holatini kiriting (Yangi ta'mirdan chiqqan)</b>",
    'uz_cyrl':"<b>Объект тамир холатини киритинг (Янги тамирдан чиккан)</b>",
    'ru':"<b> Введите статус ремонта объекта (только что вышел из ремонта) </b>"
}
get_object_situation_bag_text = {
    'uz_latn':"<code>Obyekt ta'mir holatini aniq kiriting (Yangi ta'mirdan chiqqan)</code>",
    'uz_cyrl':"<code>Объект тамир холатини аник киритинг (Янги та'мирдан чиккан)</code>",
    'ru':"<code>Четко указать статус ремонта объекта (Вновь вышел из ремонта) </code>"
}
get_object_size_text = {
    'uz_latn':"<b>Obyekt parametrlarini kiriting (maydoni,xonalar soni,qavati)</b>",
    'uz_cyrl':"<b>Объект параметрларини киритинг (майдони,хоналар сони,кавати)</b>",
    'ru':"<b>Введите параметры объекта (площадь, количество комнат, этаж) </b>"
}
get_object_size_bag_text = {
    'uz_latn':"<code>Obyekt parametrlarini aniq kiriting (maydoni,xonalar soni,qavati)</code>",
    'uz_cyrl':"<code>Объект параметрларини аник киритинг (майдони,хоналар сони,кавати)</code>",
    'ru':"<code> Четко введите параметры объекта (площадь, количество комнат, этаж) </code>"
}
get_object_pictures_text = {
    'uz_latn':"<b>Obyekt suratlarini yuboring</b>",
    'uz_cyrl':"<b>Объект суратларини юборинг</b>",
    'ru':"<b> Отправить фотографии объекта </b>"
}
get_object_pictures_again_text = {
    'uz_latn':"<b>Qo'shimcha surat bo'lsa yuboring\nYoki 👇<code>tasdiqlash</code> tugmasini bosing</b>",
    'uz_cyrl':"<b>Ко'шимча сурат бо'лса юборинг\nЙоки 👇<code>тасдиклаш</code> тугмасини босинг</b>",
    'ru':"<b> Отправьте дополнительное изображение \ nИли нажмите 👇 <code> подтвердить </code> </b>"
}
confirmation = {
    'uz_latn': "✅ Tasdiqlash",
    'uz_cyrl': "✅ Тасдиклаш",
    'ru': "✅ Подтвердить"
}

get_user_time_text = {
    'uz_latn':"<b>Qaysi vaqtda siz bilan bog'lanish qulayroq</b>",
    'uz_cyrl':"<b>Кайси вактда сиз билан богланиш кулайрок</b>",
    'ru':"<b>В какое время с вами проще связаться</b>"
}

user_confirmation_text = {
    'uz_latn':"<b>Malumotlaringiz qabul qilindi\n👇<code>✅ Tasdiqlash</code> tugmasini bosing va mutaxasislarizga yuboring</b>",
    'uz_cyrl':"<b>Малумотларингиз қабул қилинди\n👇<code>✅ Тасдиқлаш</code> тугмасини босинг ва мутахасисларизга юборинг</b>",
    'ru':"<b> Ваша информация получена \ n👇 <code> ✅ Нажмите кнопку «Подтвердить» </code> и отправьте ее своим специалистам </b>"
}

user_confirmation_and_text = {
    'uz_latn':"<code>🤵‍♂️ Arizangiz qabul qilindi Iltimos mutaxasis qo'ng'iroqini kuting 📲</code>",
    'uz_cyrl':"<code>🤵‍♂️ Аризангиз қабул қилинди Илтимос мутахасис қўнғироқини кутинг 📲</code>",
    'ru':"<code> 🤵‍♂️ Ваша заявка принята Ждите звонка специалиста 📲 </code>"
}


about_organization_text = {
    'uz_latn': """
| 🏛 <b>Biz haqimizda qisqacha ma'lumot</b> 📑
|______________________________________________
<b><u>Realty Union</u></b> <i>ko'chmas mulk agentligi poytaxtimiz 
shahrida faoliyat olib boradi;
-- Agentlikning 20 dan ortiq malakali rieltorlari 
Sizga ko'chmas mulk biznesiga oid eng to'g'ri qarorni
qabul qilishingizga ko'maklashadi;
-- Agentlikda mijozlar bilan ishlash, ularga barcha 
qulayliklarni taqdim etishga bosh qadriyat sifatida qaraladi;
-- Agentlik bilan ishlab Siz ham vaqtingizni, 
ham naqtingizni tejashingiz mumkin.</i>
_______________________________________________
""",
    'uz_cyrl': """
| 🏛 <b>Биз хакимизда кыскача ма'лумот</b> 📑
|______________________________________________
<b><u>Realty Union</u></b> <i>ko'chmas mulk agentligi poytaxtimiz
шахрида фаолият олиб боради;
-- Agentlikning 20 dan ortiq malakali rieltorlari
Sizga ko'chmas mulk biznesiga oid eng to'g'ri qarorni
кабул килишингизга ко'маклашади;
-- Агентликда мийозлар билан ишлаш, уларга барча
кулайликларни такдим этишга бош кадрият сифатида каралади;
-- Агентлик билан ишлаб Сиз хам вактингизни,
ветчина naqtingizni tejashingiz мумкин.</i>
_______________________________________________
""",
    'ru': """
| 🏛 <b> Краткая информация о нас </b> 📑
|______________________________________________
<b> <u>Realty Union</u> </b> <i>агентство недвижимости - наша столица
работает в городе;
-- Более 20 квалифицированных риелторов агентства
Правильное решение для вас в сфере недвижимости
поможет вам принять;
-- Работа с мышами в агентстве, все они
считается главной ценностью в обеспечении удобства;
-- Вы также проводите время, работая с агентством,
ветчина может сэкономить вам деньги. </i>
_______________________________________________
    """
}


communication_organization_text = {
    'uz_latn': """
<b>Biz bilan quyidagi aloqa vositalari orqali bog'lanishingiz mumkin</b> 📑
______________________________________
📮 <b>Rasmiy pochta manzilimiz</b>: <code>10000</code>

📍 <b>Manzilimiz</b>: <code>Toshkent shahri,Mirabod tumani, 
Amir Temur ko'chasi 7-uy </code>

☎️ <b>Telefon raqam</b>: <code> +998711112288 </code>

📧 <b>E-mail pochta</b>: <code> realtyunion@gmail.com </code>

<code> Lokatsiya </code> 👇
_______________________________________
""",
    'uz_cyrl': """
<b>Biz bilan quyidagi aloqa vositalari orqali bog'lanishingiz mumkin</b> 📑
_______________________________________
📮 <b>Расмий почта манзилимиз</b>: <code>10000</code>

📍 <b>Манзилимиз</b>: <code>Тошкент шахри,Мирабод тумани,
Амир Темур ко'часи 7-уй </code>

☎️ <b>Телефон</b>: <code> +998711112288 </code>

📧 <b>Электронная почта</b>: <code>realtyunion@gmail.com </code>

<code> Локация </code> 👇
________________________________________
""",
    'ru': """
<b> Вы можете связаться с нами с помощью следующих средств связи </b> 📑
________________________________________
📮 <b>Наш официальный почтовый адрес</b>: <code>10000</code>

📍 <b>Наш адрес</b>: <code> город Ташкент, Мирабадский район,
улица Амира Темура 7 </code>

☎️ <b> Номер телефона </b>: <code> +998711112288 </code>

📧 <b> Электронная почта </b>: <code> realtyunion@gmail.com </code>

<code> Геолокация </code> 👇
________________________________________
    """
}


user_setting_text = {
    'uz_latn':"🤖 <code>Siz sozlamalar qismidasiz</code> 👨‍🔧",
    'uz_cyrl':"🤖 <code>Сиз созламалар қисмидасиз</code> 👨‍🔧",
    'ru':"🤖 <code>Вы находитесь в разделе настроек </code> 👨‍🔧"
}

language = {
    'uz_lotin': "🇺🇿 Tilni o'zgartirish ♻️",
    'uz_krill': "🇺🇿 Тилни ўзгартириш ♻️",
    "ru": "🇷🇺 Изменить язык ♻️",
}
edit_phonenumber_text = {
    'uz_lotin': "☎️ Telefon raqamni o'zgartirish ♻️",
    'uz_krill': "☎️ Телефон рақамни ўзгартириш ♻️",
    "ru": "☎️ Изменить номер телефона ♻️",
}


user_setting_batton_text = {
    'uz_latn': ["🇺🇿 Tilni o'zgartirish ♻️","☎️ Telefon raqamni o'zgartirish ♻️","⬅️ Orqaga"],
    'uz_cyrl': ["🇺🇿 Тилни ўзгартириш ♻️", "☎️ Телефон рақамни ўзгартириш ♻️", "⬅️ Оркага"],
    'ru': ["🇷🇺 Изменить язык ♻️", "☎️ Изменить номер телефона ♻️", "⬅️ Назад"],
}

update_phone_number_text = {
    'uz_latn':"<b>Telefon raqamingizni qaytadan kiriting</b>",
    'uz_cyrl':"<b>Телефон рақамингизни қайтадан киритинг</b>",
    'ru':"<b> Повторно введите свой номер телефона </b>"
}

update_phone_number_succesfully_text = {
    'uz_latn':"<code>Telefon raqamingizni muvafaqiyatli o'zgartirildi</code> ✅",
    'uz_cyrl':"<code>Телефон рақамингизни мувафақиятли ўзгартирилди</code> ✅",
    'ru':"<code> Ваш номер телефона успешно изменен </code> ✅"
}

# Adminlar uchun va admin panel uchun

admin_user_to_menyu_text = {
    'uz_latn':"<code>Admin botga xush kelibsiz</code>",
    'uz_cyrl':"<code>Админ ботга хуш келибсиз</code>",
    'ru':"<code>Добро пожаловать в бот администратора</code>"
}


admin_basic_menyu_text = {
    'uz_latn': ["Foydalanuvchilar","Adminlar","Admin qo'shish","Admin o'chirish","Malumotlarni olish","Service yaratish","Service o'chirish","Statistika","Reklama","⬅️ Orqaga"],
    'uz_cyrl': ["Фойдаланувчилар", "Админлар", "Админ ко'шиш", "Админ о'чириш", "Малумотларни олыш","Сервиcе яратиш","Сервиcе ўчириш", "Статистика","Реклама", "⬅️ Оркага"],
    'ru': ["Пользователи", "Администратор", "Добавить администраторa", "Удалить администратора", "Получить данные","Создать услугу","Удалить услугу", "Статистика","Реклама", "⬅️ Назад"],
}

get_all_user_text = {
    'uz_latn':"<code>Men sizga oxirgi 50 ta foydalanuvchi haqida malumotni jo'nataman</code>",
    'uz_cyrl':"<code>Мен сизга охирги 50 та фойдаланувчи ҳақида малумотни жўнатаман</code>",
    'ru':"<code>Я вышлю вам информацию о последних 50 пользователях</code>"
}

insert_new_admin_id_text = {
    'uz_latn':"<b>Yangi adminning  ID raqamini yuboring!</b>",
    'uz_cyrl':"<b>Янги админнинг  ID рақамини юборинг!</b>",
    'ru':"<b>Отправьте новый идентификационный номер администратора!</b>"
}
insert_new_admin_id_bag_text = {
    'uz_latn':"<b>ID raqam ko'rinishida bo'ladi qaytadan yuborishingizni so'rayman!</b>",
    'uz_cyrl':"<b>ID рақам кўринишида бўлади қайтадан юборишингизни сўрайман!</b>",
    'ru':"<b>ID номер будет в форме, пожалуйста, пришлите еще раз!</b>"
}
insert_new_admin_username_text = {
    'uz_latn':"<b>Yangi adminning <u>username</u> bo'lsa yuboring aks holda '.' yuboring!</b>",
    'uz_cyrl':"<b>Янги админнинг <u>усернаме</u> бўлса юборинг акс ҳолда '.' юборинг!</b>",
    'ru':"<b> Отправить, если у нового администратора есть <u> имя пользователя </u>, в противном случае '.' отправить! </b>"
}

add_admin_succesfully_text = {
    'uz_latn':"<b>Yangi admin Muvafaqiyatli qo'shildi :)!</b>",
    'uz_cyrl':"<b>Янги админ Мувафақиятли қўшилди :)!</b>",
    'ru':"<b>Новый админ успешно добавлен :)! </b>"
}
add_admin_bag_text = {
    'uz_latn':"<b>Yangi admin qo'shilmadi :)!</b>",
    'uz_cyrl':"<b>Янги админ қўшилмади :)!</b>",
    'ru':"<b>Новый админ не добавлен :)! </b>"
}

delete_admin_text = {
    'uz_latn':"<b>O'chirmoqchi bo'lgan adminingizni ID raqamini yuboring</b>",
    'uz_cyrl':"<b>Ўчирмоқчи бўлган админингизни ИД рақамини юборинг</b>",
    'ru':"<b>Отправьте идентификационный номер администратора, которого хотите удалить.</b>"
}

delete_admin_succesfully_text = {
    'uz_latn':"<b>Admin muvafaqiyatli o'chirildi</b>",
    'uz_cyrl':"<b>Админ мувафақиятли ўчирилди</b>",
    'ru':"<b>Админ успешно удален</b>"
}

get_application_admin_text = {
    'uz_latn':"<b>Bugungi malumotlar bilan tanishing</b>",
    'uz_cyrl':"<b>Бугунги малумотлар билан танишинг</b>",
    'ru':"<b>Ознакомьтесь с сегодняшними данными</b>"
}

get_service_name_from_admin_text = {
    'uz_latn':"<b>Service nomini 3 tilda kiritasiz \n\n O'zbek lotin,O'zbek Krill,Rus tilida\nMasalan: Uy kerak,Уй керак,Возвращение на родину</b>",
    'uz_cyrl':"<b>Сервиcе номини 3 тилда киритасиз \н\н Ўзбек лотин,Ўзбек Крилл,Рус тилида\нМасалан: Uy kerak,Уй керак,Возвращение на родину</b>",
    'ru':"<b>Введите название услуги на 3-х языках\n\n Узбекская латиница, Узбекский криль, Русский\nНапример: Uy kerak,Уй керак,Возвращение на родину</b>"
}

get_service_name_from_admin_BAG_text = {
    'uz_latn':"<b><code>Sizda Xatolik</code>\n\nService nomini 3 tilda kiritasiz \n\n O'zbek lotin,O'zbek Krill,Rus tilida\nMasalan: Uy kerak,Уй керак,Возвращение на родину</b>",
    'uz_cyrl':"<b><code>Сизда Хатолик</code>\n\nСервиcе номини 3 тилда киритасиз \n\n Ўзбек лотин,Ўзбек Крилл,Рус тилида\nМасалан: Uy kerak,Уй керак,Возвращение на родину</b>",
    'ru':"<b> <code>У вас Ошибка </code> \n\nВы вводите название сервиса на 3-х языках\n\n Узбекский Латинский, Узбекский Криль, Русский\nНапример: Uy kerak,Уй керак,Возвращение на родину</b>"
}

add_service_succesfully_text = {
    'uz_latn':"<b>Service qo'shildi</b>",
    'uz_cyrl':"<b>Сервиcе қўшилди</b>",
    'ru':"<b> Служба добавлена </b>"
}
add_service_succesfully_BAG_text = {
    'uz_latn':"<b>Service qo'shilmadi</b>",
    'uz_cyrl':"<b>Сервиcе қўшилмади</b>",
    'ru':"<b>Услуга не добавлена</b>"
}

delete_service_text = {
    'uz_latn':"<b>O'chirmoqchi bo'lgan Service tanlang va u o'chadi!!!</b>",
    'uz_cyrl':"<b>Ўчирмоқчи бўлган Сервиcе танланг ва у ўчади!!!</b>",
    'ru':"<b> Выберите услугу, которую хотите удалить, и она будет удалена !!! </b>"
}

delete_service_succesfully_text = {
    'uz_latn':"<b>Service o'chirildi</b>",
    'uz_cyrl':"<b>Сервиcе ўчирилди</b>",
    'ru':"<b> Сервица удалена </b>"
}

delete_service_or_back_text = {
    'uz_latn':"<b>Yoki orqaga qaytish tugamasini bosing</b>",
    'uz_cyrl':"<b>Ёки орқага қайтиш тугамасини босинг</b>",
    'ru':"<b>Или нажмите кнопку назад </b>"
}

help_text = {
    'uz_latn':"<b>Botni ishlatish bo'yicha qo'llanma bo'lishi kerak</b>",
    'uz_cyrl':"<b>Ботни ишлатиш бўйича қўлланма бўлиши керак</b>",
    'ru':"<b>Должно быть руководство по использованию бота</b>"
}

reklama_text = {
    'uz_latn':"<b>Reklama xabarini TEXT,VIDEO,RASM ko'rinishida yuborishingiz mumkin</b>!",
    'uz_cyrl':"<b> Вы можете отправить рекламное сообщение в виде ТЕКСТА, ВИДЕО, ФОТО</b>!",
    'ru':"<b>Реклама хабарини ТЕХТ,ВИДЕО,РАСМ кўринишида юборишингиз мумкин</b>!"
}


